# Projet 
    - L'objectif de ce projet est de mettre en place un pipeline de données. Les données seront extraites à partir du site 
    data gouv puis seront traitées et charger dans une base de données PostgreSQL. C'est donc un processus ETL. 
    La restitution sera faite via Power BI.

In [24]:
# Importation des librairies
#import requests
#from bs4 import BeautifulSoup
import pandas as pd
import psycopg2
import sqlalchemy
from sqlalchemy import create_engine
#import os
#from io import StringIO

# 1) Extraction

Pour réaliser ce projet, nous avons besoin d'importéles données qui se trouvent sur le site internet open data gouv dont le lien se trouve ici : https://www.data.gouv.fr/fr/datasets/bases-de-donnees-annuelles-des-accidents-corporels-de-la-circulation-routiere-annees-de-2005-a-2022/

In [3]:
usagers = 'https://www.data.gouv.fr/fr/datasets/r/62c20524-d442-46f5-bfd8-982c59763ec8'
vehicules = 'https://www.data.gouv.fr/fr/datasets/r/c9742921-4427-41e5-81bc-f13af8bc31a0'
lieux = 'https://www.data.gouv.fr/fr/datasets/r/a6ef711a-1f03-44cb-921a-0ce8ec975995'
caracteristiques = 'https://www.data.gouv.fr/fr/datasets/r/5fc299c0-4598-4c29-b74c-6a67b0cc27e7'

In [4]:
"""
    Nous allons ici lire les données avec la librairie pandas
"""
df_usagers = pd.read_csv(usagers, delimiter = ';')
df_vehicules = pd.read_csv(vehicules, delimiter = ';')
df_lieux = pd.read_csv(lieux, delimiter = ';')
df_caracteristiques = pd.read_csv(caracteristiques, delimiter = ';')

C:\Users\abeng\AppData\Local\Temp\ipykernel_19864\2290742422.py:6: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  df_lieux = pd.read_csv(lieux, delimiter = ';')

# 2) Traitement 
Dans cette partie, nous allons effectué plusieus transformations (par exemple : renommer les colonnes, changer les modalitées, traiter les valeurs maquantes ...) sur les jeux de données.

In [5]:
df_usagers = df_usagers.rename(columns = {"Num_Acc" : "num_acc"})
df_usagers.head()

,num_acc,id_usager,id_vehicule,num_veh,place,catu,grav,sexe,an_nais,trajet,secu1,secu2,secu3,locp,actp,etatp
0,202200000001,1 099 700,813 952,A01,1,1,3,1,2008.0,5,2,8,-1,-1,-1,-1
1,202200000001,1 099 701,813 953,B01,1,1,1,1,1948.0,5,1,8,-1,-1,-1,-1
2,202200000002,1 099 698,813 950,B01,1,1,4,1,1988.0,9,1,0,-1,0,0,-1
3,202200000002,1 099 699,813 951,A01,1,1,1,1,1970.0,4,1,0,-1,0,0,-1
4,202200000003,1 099 696,813 948,A01,1,1,1,1,2002.0,0,1,0,-1,-1,-1,-1

In [6]:
df_caracteristiques = df_caracteristiques.rename(columns = {"Accident_Id" : "accident_id"})
df_caracteristiques.head()

,accident_id,jour,mois,an,hrmn,lum,dep,com,agg,int,atm,col,adr,lat,long
0,202200000001,19,10,2022,16:15,1,26,26198,2,3,1,3,TEIL(vieille route du),"44,5594200000","4,7257200000"
1,202200000002,20,10,2022,08:34,1,25,25204,2,3,1,3,Miranda,"46,9258100000","6,3462000000"
2,202200000003,20,10,2022,17:15,1,22,22360,2,6,1,2,ROND POINT DE BREZILLET,"48,4931620000","-2,7604390000"
3,202200000004,20,10,2022,18:00,1,16,16102,2,3,8,6,LOHMEYER (RUE),"45,6926520000","-0,3262900000"
4,202200000005,19,10,2022,11:45,1,13,13103,1,1,1,2,ROUTE DE JEAN MOULIN-RN 538,"43,6755790366","5,0927031775"

In [7]:
df_lieux = df_lieux.rename(columns = {"Num_Acc" : "num_acc"})
df_lieux.head()

,num_acc,catr,voie,v1,v2,circ,nbv,vosp,prof,pr,pr1,plan,lartpc,larrout,surf,infra,situ,vma
0,202200000001,4,TEIL(vieille route du),0,NaN,2,2,0,1,(1),(1),1,NaN,-1,1,0,1,50
1,202200000002,4,NaN,0,NaN,2,2,0,1,(1),(1),1,NaN,-1,1,0,1,50
2,202200000003,3,ROND POINT DE BREZILLET,0,NaN,-1,2,0,1,0,0,1,NaN,-1,1,5,1,50
3,202200000004,4,QUATORZE JUILLET (RUE DU),0,NaN,1,1,0,2,(1),(1),1,NaN,4,1,0,1,30
4,202200000005,3,ROUTE DE JEAN MOULIN-RN 538,0,NaN,2,2,0,1,8,0,1,NaN,-1,1,0,1,80

In [8]:
df_vehicules = df_vehicules.rename(columns = {"Num_Acc" : "num_acc"})
df_vehicules.head()

,num_acc,id_vehicule,num_veh,senc,catv,obs,obsm,choc,manv,motor,occutc
0,202200000001,813 952,A01,1,2,0,2,1,9,1,NaN
1,202200000001,813 953,B01,1,7,0,2,2,1,1,NaN
2,202200000002,813 950,B01,2,7,0,2,8,15,1,NaN
3,202200000002,813 951,A01,2,10,0,2,1,1,1,NaN
4,202200000003,813 948,A01,2,7,0,2,1,2,1,NaN

In [9]:
'''
    Nous remplaçons quelques modalités du jeu de données usagers
'''
df_usagers['catu'] = df_usagers['catu'].replace([1, 3, 2], ['Conducteur', 'Pieton', 'Passager'])
df_usagers.grav = df_usagers.grav.replace([1, 2, 3, 4], ['Indemne', 'Tué', 'Blessé hospitalisé', 'Blessé léger'])
df_usagers.sexe = df_usagers.sexe.replace([1, 2], ['M', 'F'])
df_usagers.trajet = df_usagers.trajet.replace([1, 2, 3, 4, 5, 9], ['Domicile_travail', 'Domicile_école', 'Courses_achats', 'usage_pro', 'loisirs', 'Autre'])
df_usagers['etatp'] = df_usagers['etatp'].replace([1, 2, 3], ['Seul', 'Accompagné', 'En_groupe'])

In [10]:
'''
    Nous remplaçons quelque modalités du jeu de données caracteristique
'''
df_caracteristiques.lum = df_caracteristiques.lum.replace([1, 5, 3, 2, 4], ['Plein_jour', 'Nuit_eclairage_pub', 'Nuit_sans_eclairage_pub', 'aube', 'Nuit_avec_eclairage_pub'])
df_caracteristiques['agg'] = df_caracteristiques['agg'].replace([1, 2], ['Hors_agglomération', 'En_agglomération'])

In [11]:
df_lieux['catr'] = df_lieux['catr'].replace([1, 2, 3, 4, 5, 6, 7, 9], 
                                              ['Autoroute', 'Route nationale', 'Route departementale', 'Voie comunales', 'Hors réseau public', 'Parc de stationnement ouvert à la circulation publique', 'Routes de métropole urbaine', 'autre'])

df_lieux['circ'] = df_lieux['circ'].replace([1, 2, 3, 4], ['A sens unique', 'Bidirectionnelle', 'A chaussées séparées', 'Avec voies d’affectation variable'])


df_lieux['surf'] = df_lieux['surf'].replace([1, 2, 3, 4, 5, 6, 7, 8, 9], ['Normale', 'Mouillée', 'Flaques', 'Inondée', 'Enneigée', 'Boue', 'Verglacée', 'Corps gras huile', 'Autre'])


df_lieux['situ'] = df_lieux['situ'].replace([0, 1, 2, 3, 4, 5, 6, 8], ['Aucun', 'Sur chaussée', 'Sur bande d’arrêt d’urgence', 'Sur accotement', 'Sur trottoire', 'Sur piste cyclable', 'Sur autre voie spéciale', 'Autres'])

In [12]:
'''
    Pour simplifier et gagner en espace, on va supprimer certaines colonnes non pertinantes.
'''

df_usagers_f = df_usagers.drop(['secu2', 'secu3', 'locp', 'actp'], axis = 1)
df_lieux_f = df_lieux.drop(['v1', 'vosp', 'prof', 'pr', 'pr1', 'plan', 'larrout', 'infra'], axis = 1)
df_vehicules_f = df_vehicules.drop(['senc', 'obs', 'obsm', 'choc', 'manv', 'occutc'], axis = 1)
df_caracteristiques_f = df_caracteristiques.drop(['lat', 'long'], axis = 1)

In [13]:
df_usagers_f.head()

,num_acc,id_usager,id_vehicule,num_veh,place,catu,grav,sexe,an_nais,trajet,secu1,etatp
0,202200000001,1 099 700,813 952,A01,1,Conducteur,Blessé hospitalisé,M,2008.0,loisirs,2,-1
1,202200000001,1 099 701,813 953,B01,1,Conducteur,Indemne,M,1948.0,loisirs,1,-1
2,202200000002,1 099 698,813 950,B01,1,Conducteur,Blessé léger,M,1988.0,Autre,1,-1
3,202200000002,1 099 699,813 951,A01,1,Conducteur,Indemne,M,1970.0,usage_pro,1,-1
4,202200000003,1 099 696,813 948,A01,1,Conducteur,Indemne,M,2002.0,0,1,-1

In [14]:
df_caracteristiques_f.head()

,accident_id,jour,mois,an,hrmn,lum,dep,com,agg,int,atm,col,adr
0,202200000001,19,10,2022,16:15,Plein_jour,26,26198,En_agglomération,3,1,3,TEIL(vieille route du)
1,202200000002,20,10,2022,08:34,Plein_jour,25,25204,En_agglomération,3,1,3,Miranda
2,202200000003,20,10,2022,17:15,Plein_jour,22,22360,En_agglomération,6,1,2,ROND POINT DE BREZILLET
3,202200000004,20,10,2022,18:00,Plein_jour,16,16102,En_agglomération,3,8,6,LOHMEYER (RUE)
4,202200000005,19,10,2022,11:45,Plein_jour,13,13103,Hors_agglomération,1,1,2,ROUTE DE JEAN MOULIN-RN 538

In [15]:
# On crée une table catego_usagers en supprimant les autres colonnes
catego_usagers = df_usagers_f.drop(['num_acc', 'id_vehicule', 'num_veh', 'place', 'grav', 'trajet', 'secu1', 'etatp'], axis = 1)

In [16]:
catego_usagers.head()

   id_usager        catu sexe  an_nais
0  1 099 700  Conducteur    M   2008.0
1  1 099 701  Conducteur    M   1948.0
2  1 099 698  Conducteur    M   1988.0
3  1 099 699  Conducteur    M   1970.0
4  1 099 696  Conducteur    M   2002.0

In [17]:
# On creer une table circonstance 
circonstances = df_usagers_f.drop(['catu', 'sexe', 'an_nais'], axis = 1)
#circonstances = circonstances.rename(columns = {"Num_Acc" : "num_acc"})

In [18]:
circonstances.head()

,num_acc,id_usager,id_vehicule,num_veh,place,grav,trajet,secu1,etatp
0,202200000001,1 099 700,813 952,A01,1,Blessé hospitalisé,loisirs,2,-1
1,202200000001,1 099 701,813 953,B01,1,Indemne,loisirs,1,-1
2,202200000002,1 099 698,813 950,B01,1,Blessé léger,Autre,1,-1
3,202200000002,1 099 699,813 951,A01,1,Indemne,usage_pro,1,-1
4,202200000003,1 099 696,813 948,A01,1,Indemne,0,1,-1

In [19]:
# On crée une table calendrier en supprimant certaines colonnes de la table caractéristique 
calendrier = df_caracteristiques_f.drop(['accident_id', 'lum', 'dep', 'com', 'agg', 'int', 'atm', 'col', 'adr'], axis = 1)

# On recupère l'index pour créer un clée primaire (identifiant de la table calendrier)
calendrier['calen_id'] = calendrier.index

In [20]:
calendrier.head()

   jour  mois    an   hrmn  calen_id
0    19    10  2022  16:15         0
1    20    10  2022  08:34         1
2    20    10  2022  17:15         2
3    20    10  2022  18:00         3
4    19    10  2022  11:45         4

In [21]:
df_caracteristiques_f = df_caracteristiques_f.drop(['jour', 'mois', 'an', 'hrmn'], axis = 1)
#df_caracteristiques_f = df_caracteristiques_f.rename(columns = {"Accident_Id" : "accident_id"})
df_caracteristiques_f['calen_id'] = df_caracteristiques_f.index
df_caracteristiques_f.head()

,accident_id,lum,dep,com,agg,int,atm,col,adr,calen_id
0,202200000001,Plein_jour,26,26198,En_agglomération,3,1,3,TEIL(vieille route du),0
1,202200000002,Plein_jour,25,25204,En_agglomération,3,1,3,Miranda,1
2,202200000003,Plein_jour,22,22360,En_agglomération,6,1,2,ROND POINT DE BREZILLET,2
3,202200000004,Plein_jour,16,16102,En_agglomération,3,8,6,LOHMEYER (RUE),3
4,202200000005,Plein_jour,13,13103,Hors_agglomération,1,1,2,ROUTE DE JEAN MOULIN-RN 538,4

In [22]:
df_lieux_f.head()

,num_acc,catr,voie,v2,circ,nbv,lartpc,surf,situ,vma
0,202200000001,Voie comunales,TEIL(vieille route du),NaN,Bidirectionnelle,2,NaN,Normale,Sur chaussée,50
1,202200000002,Voie comunales,NaN,NaN,Bidirectionnelle,2,NaN,Normale,Sur chaussée,50
2,202200000003,Route departementale,ROND POINT DE BREZILLET,NaN,-1,2,NaN,Normale,Sur chaussée,50
3,202200000004,Voie comunales,QUATORZE JUILLET (RUE DU),NaN,A sens unique,1,NaN,Normale,Sur chaussée,30
4,202200000005,Route departementale,ROUTE DE JEAN MOULIN-RN 538,NaN,Bidirectionnelle,2,NaN,Normale,Sur chaussée,80

In [23]:
df_vehicules_f.head()

        num_acc id_vehicule num_veh  catv  motor
0  202200000001     813 952     A01     2      1
1  202200000001     813 953     B01     7      1
2  202200000002     813 950     B01     7      1
3  202200000002     813 951     A01    10      1
4  202200000003     813 948     A01     7      1

# 3 Chargement

Connexion à la base de données

In [26]:
"""
    On va créer une fonction va permettre de se connecter à la base de dnnées
    et de creer notre base de donnée
"""

def creer_base():
    # On se connecte à la base par defaut
    con = psycopg2.connect(
        host = 'localhost',
        database = "postgres",
        user = "postgres",
        password = "****"
    )
    
    con.set_session(autocommit = True)
    cur = con.cursor()
    
    # On va créer la base de données
    #cur.execute("DROP DATABASE projet_circulation_a")
    cur.execute("CREATE DATABASE projet_circulation_a")
    
    # On ferme la connexion par defaut
    cur.close()
    
    # On se connecte à la base de données crée
    con = psycopg2.connect(
        host = "localhost",
        database = "projet_circulation_a",
        user = "postgres",
        password = "****"
    )
    cur = con.cursor()
    
    return cur, con

In [27]:
cur, con = creer_base()

a) Une fois connecter à la base de données, on commence la création des tables dans lesquelles les données seront stockées.

In [28]:
# On va creer les tables

# 1) Tables circonstances
t_circonstances = ("""CREATE TABLE IF NOT EXISTS circonstances(
    num_acc       VARCHAR(20),
    id_vehicule   VARCHAR(20),
    num_veh       VARCHAR(5),
    place         int,
    grav          text,
    trajet        text,
    secu1         text,
    etatp         text
)""")
cur.execute(t_circonstances)
con.commit()

In [29]:
# 2) Table catego_usagers
t_catego_usagers = ("""CREATE TABLE IF NOT EXISTS catego_usagers(
    id_usager    VARCHAR(15),
    sexe         VARCHAR(5),
    an_nais      int,
    catu         text,
    CONSTRAINT pk_catego_usagers PRIMARY KEY (id_usager)

)""")
cur.execute(t_catego_usagers)
con.commit()

In [30]:
# 3) Table lieux
t_lieux = ("""CREATE TABLE IF NOT EXISTS lieux(
    num_acc   VARCHAR(20),
    catr      text,
    voie      text,
    v2        text,
    circ      text,
    nbv       text,
    lartpc    text,
    surf      text,
    situ      text,
    vma       int,
    CONSTRAINT pk_lieux PRIMARY KEY (Num_Acc)
)""")
cur.execute(t_lieux)
con.commit()

In [31]:
# 4) Table vehicule
t_vehicules = ("""CREATE TABLE IF NOT EXISTS vehicules(
    aum_acc      varchar(20),
    id_vehicule  varchar(10),
    num_veh      varchar(5),
    catv         text,
    motor        text,
    CONSTRAINT "pk_vehicules" PRIMARY KEY (id_vehicule)
)""")
cur.execute(t_vehicules)
con.commit()

In [32]:
# 5) caracteristiques
t_caracteristiques = ("""CREATE TABLE IF NOT EXISTS caracteristiques(
    accident_id varchar(20),
    calen_id    int,
    lum         text,
    dep         int,
    com         int,
    agg         text,
    int         int,
    atm         text,
    col         text,
    adr         text,
    CONSTRAINT pk_caracteristiques PRIMARY KEY (Accident_Id)
)""")
cur.execute(t_caracteristiques)
con.commit()

In [33]:
# 6) Table calendrier
t_calendrier = ("""CREATE TABLE IF NOT EXISTS calendrier(
    calen_id    int,
    jour        int,
    mois        int,
    an          int,
    hrmn        time,
    CONSTRAINT pk_calendrier PRIMARY KEY (calen_id)
)""")
cur.execute(t_calendrier)
con.commit()

In [34]:
con.close()

b) Après la création de ces tables, on va commenncer le chargement des données en utilisant la librairie sqlalchemy.

In [35]:
# On se reconnecte dans la base de données postgreSQL
engine = create_engine('postgresql+psycopg2://postgres:****@localhost/projet_circulation_a')

In [36]:
engine

Engine(postgresql+psycopg2://postgres:***@localhost/projet_circulation_a)

In [37]:
circonstances.to_sql('circonstances', engine, if_exists = 'replace', index = False)
catego_usagers.to_sql('catego_usagers', engine, if_exists = 'replace', index = False)
df_lieux_f.to_sql('lieux', engine, if_exists = 'replace', index = False)
df_vehicules_f.to_sql('vehicules', engine, if_exists = 'replace', index = False)
df_caracteristiques_f.to_sql('caracteristiques', engine, if_exists = 'replace', index = False)
calendrier.to_sql('calendrier', engine, if_exists = 'replace', index = False)

302